In [1]:
# Dependencies
from bs4 import BeautifulSoup
import requests
import pandas as pd
from sqlalchemy import create_engine
import psycopg2

In [2]:
#Read Data Analyst CSV file 
csv_file = 'ResouceData/DataAnalyst.csv'
data_analyst_df = pd.read_csv(csv_file)
data_analyst_df.head()

#Clean Data Analyst DataFrame
new_data_analyst_df = data_analyst_df[['Job Title', 'Salary Estimate', 'Industry', 'Location']].copy()
new_data_analyst_df.dropna()
new_data_analyst_df.head()

,Job Title,Salary Estimate,Industry,Location
0,"Data Analyst, Center on Immigration and Justic...",$37K-$66K (Glassdoor est.),Social Assistance,"New York, NY"
1,Quality Data Analyst,$37K-$66K (Glassdoor est.),Health Care Services & Hospitals,"New York, NY"
2,"Senior Data Analyst, Insights & Analytics Team...",$37K-$66K (Glassdoor est.),Internet,"New York, NY"
3,Data Analyst,$37K-$66K (Glassdoor est.),IT Services,"New York, NY"
4,Reporting Data Analyst,$37K-$66K (Glassdoor est.),Sports & Recreation,"New York, NY"

In [3]:
clean_salary_estimate = new_data_analyst_df['Salary Estimate'].head()
clean_salary_estimate
new_data_analyst_df['Salary Estimate'].str.split('-')
new=new_data_analyst_df["Salary Estimate"].str.split(" ", n = 1, expand = True)
sal_range=new[0].str.split('-',n=1,expand=True)
new_data_analyst_df['Lower'] = sal_range[0]
new_data_analyst_df['Upper'] = sal_range[1]
#new_data_analyst_df.head()
#new_data_analyst_df.drop('Salary Estimate',axis=1,inplace=True)
#new_data_analyst_df.head()
new_data_analyst_df['Lower']=new_data_analyst_df['Lower'].str.replace('K','000')
new_data_analyst_df['Lower']=new_data_analyst_df['Lower'].str.replace('$','')
new_data_analyst_df['Upper']=new_data_analyst_df['Upper'].str.replace('K','000')
new_data_analyst_df['Upper']=new_data_analyst_df['Upper'].str.replace('P','000')
new_data_analyst_df['Upper']=new_data_analyst_df['Upper'].str.replace('$','')
new_data_analyst_df['Upper']=new_data_analyst_df['Upper'].str.rstrip("(Employer")
new_data_analyst_df.head()
clean_up = new_data_analyst_df['Upper'].unique()
new_data_analyst_df['Lower'].replace('',0,inplace=True)
new_data_analyst_df['Lower']=new_data_analyst_df['Lower'].astype('float')
new_data_analyst_df['Upper'].replace('',0,inplace=True)
new_data_analyst_df['Upper']=new_data_analyst_df['Upper'].astype('float')
#new_data_analyst_df.info()
new_data_analyst_df['Average_Sal'] = (new_data_analyst_df['Lower']+new_data_analyst_df['Upper'])/2
#new_data_analyst_df.head()

new_state = new_data_analyst_df['Location'].str.split(',',n=1,expand=True)
new_data_analyst_df['City'] = new_state[0]
new_data_analyst_df['State'] = new_state[1]

new_data_analyst_df.head()

#Rename Columns
clean_data_analyst_df = new_data_analyst_df.rename(columns={"Job Title":"job_title", "Salary Estimate":"salary_estimate", "Industry":"industry", "Location":"location","Lower":"lower","Upper":"upper","Average_Sal":"average_sal","State":"state","City":"city"})
clean_data_analyst_df.head()

,job_title,salary_estimate,industry,location,lower,upper,average_sal,city,state
0,"Data Analyst, Center on Immigration and Justic...",$37K-$66K (Glassdoor est.),Social Assistance,"New York, NY",37000.0,66000.0,51500.0,New York,NY
1,Quality Data Analyst,$37K-$66K (Glassdoor est.),Health Care Services & Hospitals,"New York, NY",37000.0,66000.0,51500.0,New York,NY
2,"Senior Data Analyst, Insights & Analytics Team...",$37K-$66K (Glassdoor est.),Internet,"New York, NY",37000.0,66000.0,51500.0,New York,NY
3,Data Analyst,$37K-$66K (Glassdoor est.),IT Services,"New York, NY",37000.0,66000.0,51500.0,New York,NY
4,Reporting Data Analyst,$37K-$66K (Glassdoor est.),Sports & Recreation,"New York, NY",37000.0,66000.0,51500.0,New York,NY

In [4]:
from config import username, password

#Create Engine and connection to Database
engine = create_engine(f'postgresql://{username}:{password}@localhost:5432/Datajob_db')
connection = engine.connect()

#Verify tables
engine.table_names()

['data_scientist',
 'data_scientist_final',
 'data_analyst_final',
 'data_engineer',
 'data_engineer_final',
 'data_analyst']

In [5]:
#Use pandas to load data analyst csv into converted DataFrame into database
clean_data_analyst_df.to_sql(name='data_analyst', con=engine, if_exists='replace', index=False)

In [6]:
#confirm data has been added by querying table
#psql_data_analyst = pd.read_sql_query('select * from data_analyst', con=engine)
#psql_data_analyst.head()

psql_filter_data = pd.read_sql_query("select job_title, round(cast(AVG(average_sal) as numeric),2) avgsal,state,city from data_analyst group by job_title,state,city", con=engine)
psql_filter_data_df= psql_filter_data.dropna()
psql_filter_data_df.head()

#Rename Columns
report_data_analyst_df = psql_filter_data_df.rename(columns={"job_title":"job_title","avgsal":"average_sal","state":"state","city":"city"})
#report_data_analyst_df

report_data_analyst_df.to_sql(name='data_analyst_final', con=engine, if_exists='replace', index=False)

psql_final_data_analyst = pd.read_sql_query('select * from data_analyst_final', con=engine)
psql_final_data_analyst.head()

,job_title,average_sal,state,city
0,"Data Analyst - Beatrice Rogers Research, Fried...",49500.00,MA,Boston
1,Data Analyst II (Healthcare Analytics),97833.33,MO,Clayton
2,Financial Data Analyst,63000.00,TX,Plano
3,Data Analyst w/ Healthcare,48500.00,TN,Nashville
4,Business / Data Analyst with Accounting,84500.00,FL,Clearwater

In [7]:
#Read Data Scientist CSV file
csv_file = 'ResouceData/DataScientist.csv'
data_scienctist_df = pd.read_csv(csv_file)
data_scienctist_df.head()

#Clean Data Scientist DataFrame
new_data_scienctist_df = data_scienctist_df[['Job Title', 'Salary Estimate', 'Industry', 'Location']].copy()
new_data_scienctist_df.dropna()
new_data_scienctist_df.head()

,Job Title,Salary Estimate,Industry,Location
0,Senior Data Scientist,$111K-$181K (Glassdoor est.),Travel Agencies,"New York, NY"
1,"Data Scientist, Product Analytics",$111K-$181K (Glassdoor est.),"Health, Beauty, & Fitness","New York, NY"
2,Data Science Manager,$111K-$181K (Glassdoor est.),-1,"New York, NY"
3,Data Analyst,$111K-$181K (Glassdoor est.),Internet,"Lyndhurst, NJ"
4,"Director, Data Science",$111K-$181K (Glassdoor est.),Advertising & Marketing,"New York, NY"

In [8]:
clean_salary_estimate = new_data_scienctist_df['Salary Estimate'].head()
clean_salary_estimate
new_data_scienctist_df['Salary Estimate'].str.split('-')
new=new_data_scienctist_df["Salary Estimate"].str.split(" ", n = 1, expand = True)
sal_range=new[0].str.split('-',n=1,expand=True)
new_data_scienctist_df['Lower'] = sal_range[0]
new_data_scienctist_df['Upper'] = sal_range[1]
#new_data_analyst_df.head()
#new_data_analyst_df.drop('Salary Estimate',axis=1,inplace=True)
#new_data_analyst_df.head()
new_data_scienctist_df['Lower']=new_data_scienctist_df['Lower'].str.replace('K','000')
new_data_scienctist_df['Lower']=new_data_scienctist_df['Lower'].str.replace('$','')
new_data_scienctist_df['Upper']=new_data_scienctist_df['Upper'].str.replace('K','000')
new_data_scienctist_df['Upper']=new_data_scienctist_df['Upper'].str.replace('P','000')
new_data_scienctist_df['Upper']=new_data_scienctist_df['Upper'].str.replace('$','')
new_data_scienctist_df['Upper']=new_data_scienctist_df['Upper'].str.rstrip("(Employer")
new_data_scienctist_df.head()
clean_up = new_data_scienctist_df['Upper'].unique()
new_data_scienctist_df['Lower'].replace('',0,inplace=True)
new_data_scienctist_df['Lower']=new_data_scienctist_df['Lower'].astype('float')
new_data_scienctist_df['Upper'].replace('',0,inplace=True)
new_data_scienctist_df['Upper']=new_data_scienctist_df['Upper'].astype('float')
#new_data_engineer_df.info()
new_data_scienctist_df['Average_Sal'] = (new_data_scienctist_df['Lower']+new_data_scienctist_df['Upper'])/2
#new_data_engineer_df.head()

new_state = new_data_scienctist_df['Location'].str.split(',',n=1,expand=True)
new_data_scienctist_df['City'] = new_state[0]
new_data_scienctist_df['State'] = new_state[1]

new_data_scienctist_df.head()

#Rename Columns
clean_data_scienctist_df = new_data_scienctist_df.rename(columns={"Job Title":"job_title", "Salary Estimate":"salary_estimate", "Industry":"industry", "Location":"location","Lower":"lower","Upper":"upper","Average_Sal":"average_sal","State":"state","City":"city"})
clean_data_scienctist_df.head()

,job_title,salary_estimate,industry,location,lower,upper,average_sal,city,state
0,Senior Data Scientist,$111K-$181K (Glassdoor est.),Travel Agencies,"New York, NY",111000.0,181000.0,146000.0,New York,NY
1,"Data Scientist, Product Analytics",$111K-$181K (Glassdoor est.),"Health, Beauty, & Fitness","New York, NY",111000.0,181000.0,146000.0,New York,NY
2,Data Science Manager,$111K-$181K (Glassdoor est.),-1,"New York, NY",111000.0,181000.0,146000.0,New York,NY
3,Data Analyst,$111K-$181K (Glassdoor est.),Internet,"Lyndhurst, NJ",111000.0,181000.0,146000.0,Lyndhurst,NJ
4,"Director, Data Science",$111K-$181K (Glassdoor est.),Advertising & Marketing,"New York, NY",111000.0,181000.0,146000.0,New York,NY

In [9]:
#Use pandas to load data analyst csv into converted DataFrame into database
clean_data_scienctist_df.to_sql(name='data_scientist', con=engine, if_exists='replace', index=False)

In [10]:
#confirm data has been added by querying table
#pd.read_sql_query('select * from data_scientist', con=engine).head()

psql_filter_data_scientist = pd.read_sql_query("select job_title, round(cast(AVG(average_sal) as numeric),2) avgsal,state,city from data_scientist group by job_title,state,city", con=engine)
psql_filter_data_scientist_df= psql_filter_data_scientist.dropna()
psql_filter_data_scientist_df.head()

#Rename Columns
report_data_scientist_df = psql_filter_data_scientist_df.rename(columns={"job_title":"job_title","avgsal":"average_sal","state":"state","city":"city"})
#report_data_scientist_df

report_data_scientist_df.to_sql(name='data_scientist_final', con=engine, if_exists='replace', index=False)

psql_final_data_scientist = pd.read_sql_query('select * from data_scientist_final', con=engine)
psql_final_data_scientist.head()

                                   job_title  average_sal state          city
0    Signal Processing Engineer/Data Analyst     183000.0    CA  Redwood City
1                              DATA ENGINEER     126000.0    TX        Austin
2          Quantitative Analytics Consultant     101500.0    CA      La Jolla
3               Senior Scientist-UV Coatings      78500.0    NJ   Cherry Hill
4  Data Science with Strong Python Knowledge      80500.0    AZ       Phoenix

In [11]:
#Read Data Engineer CSV file
csv_file = 'ResouceData/DataEngineer.csv'
data_engineer_df = pd.read_csv(csv_file)
data_engineer_df.head()

#Clean Data Engineer DataFrame
new_data_engineer_df = data_engineer_df[['Job Title', 'Salary Estimate', 'Industry', 'Location']].copy()
new_data_engineer_df.dropna()
new_data_engineer_df.head()

,Job Title,Salary Estimate,Industry,Location
0,Data Engineer,$80K-$150K (Glassdoor est.),Consulting,"New York, NY"
1,Senior Data Engineer (Healthcare Domain experi...,$80K-$150K (Glassdoor est.),IT Services,"New York, NY"
2,Data Engineers,$80K-$150K (Glassdoor est.),IT Services,"New York, NY"
3,Client Trade Support Engineer,$80K-$150K (Glassdoor est.),Investment Banking & Asset Management,"New York, NY"
4,Data Engineer,$80K-$150K (Glassdoor est.),Insurance Carriers,"New York, NY"

In [12]:
clean_salary_estimate = new_data_engineer_df['Salary Estimate'].head()
clean_salary_estimate
new_data_engineer_df['Salary Estimate'].str.split('-')
new=new_data_engineer_df["Salary Estimate"].str.split(" ", n = 1, expand = True)
sal_range=new[0].str.split('-',n=1,expand=True)
new_data_engineer_df['Lower'] = sal_range[0]
new_data_engineer_df['Upper'] = sal_range[1]
#new_data_analyst_df.head()
#new_data_analyst_df.drop('Salary Estimate',axis=1,inplace=True)
#new_data_analyst_df.head()
new_data_engineer_df['Lower']=new_data_engineer_df['Lower'].str.replace('K','000')
new_data_engineer_df['Lower']=new_data_engineer_df['Lower'].str.replace('$','')
new_data_engineer_df['Upper']=new_data_engineer_df['Upper'].str.replace('K','000')
new_data_engineer_df['Upper']=new_data_engineer_df['Upper'].str.replace('P','000')
new_data_engineer_df['Upper']=new_data_engineer_df['Upper'].str.replace('$','')
new_data_engineer_df['Upper']=new_data_engineer_df['Upper'].str.rstrip("(Employer")
new_data_engineer_df.head()
clean_up = new_data_engineer_df['Upper'].unique()
new_data_engineer_df['Lower'].replace('',0,inplace=True)
new_data_engineer_df['Lower']=new_data_engineer_df['Lower'].astype('float')
new_data_engineer_df['Upper'].replace('',0,inplace=True)
new_data_engineer_df['Upper']=new_data_engineer_df['Upper'].astype('float')
#new_data_engineer_df.info()
new_data_engineer_df['Average_Sal'] = (new_data_engineer_df['Lower']+new_data_engineer_df['Upper'])/2
#new_data_engineer_df.head()

new_state = new_data_engineer_df['Location'].str.split(',',n=1,expand=True)
new_data_engineer_df['City'] = new_state[0]
new_data_engineer_df['State'] = new_state[1]

new_data_engineer_df.head()

#Rename Columns
clean_data_engineer_df = new_data_engineer_df.rename(columns={"Job Title":"job_title", "Salary Estimate":"salary_estimate", "Industry":"industry", "Location":"location","Lower":"lower","Upper":"upper","Average_Sal":"average_sal","State":"state","City":"city"})
clean_data_engineer_df.head()

,job_title,salary_estimate,industry,location,lower,upper,average_sal,city,state
0,Data Engineer,$80K-$150K (Glassdoor est.),Consulting,"New York, NY",80000.0,150000.0,115000.0,New York,NY
1,Senior Data Engineer (Healthcare Domain experi...,$80K-$150K (Glassdoor est.),IT Services,"New York, NY",80000.0,150000.0,115000.0,New York,NY
2,Data Engineers,$80K-$150K (Glassdoor est.),IT Services,"New York, NY",80000.0,150000.0,115000.0,New York,NY
3,Client Trade Support Engineer,$80K-$150K (Glassdoor est.),Investment Banking & Asset Management,"New York, NY",80000.0,150000.0,115000.0,New York,NY
4,Data Engineer,$80K-$150K (Glassdoor est.),Insurance Carriers,"New York, NY",80000.0,150000.0,115000.0,New York,NY

In [13]:
from config import username, password

#Create Engine and connection to Database
engine = create_engine(f'postgresql://{username}:{password}@localhost:5432/Datajob_db')
connection = engine.connect()

#Verify tables
engine.table_names()

['data_analyst',
 'data_analyst_final',
 'data_scientist',
 'data_scientist_final',
 'data_engineer',
 'data_engineer_final']

In [14]:
#Use pandas to load data analyst csv into converted DataFrame into database
clean_data_engineer_df.to_sql(name='data_engineer', con=engine, if_exists='replace', index=False)

In [15]:
psql_filter_data = pd.read_sql_query("select job_title, round(cast(AVG(average_sal) as numeric),2) avgsal,state,city from data_engineer group by job_title,state,city", con=engine)
psql_filter_data_df= psql_filter_data.dropna()
psql_filter_data_df.head()

#Rename Columns
report_data_engineer_df = psql_filter_data_df.rename(columns={"job_title":"job_title","avgsal":"average_sal","state":"state","city":"city"})
report_data_engineer_df

report_data_engineer_df.to_sql(name='data_engineer_final', con=engine, if_exists='replace', index=False)

psql_final_data_engineer = pd.read_sql_query('select * from data_engineer_final', con=engine)
psql_final_data_engineer.head()

                        job_title  average_sal state         city
0        Database Engineer (Temp)     204000.0    CA    San Diego
1  Data Engineer for TeleHealth /     129000.0    CA  Los Angeles
2                   DATA ENGINEER     125500.0    TX       Austin
3                   Cost Engineer      98500.0    TX      Houston
4  Rotor System Analysis Engineer     101250.0    TX   Fort Worth